#ifndef JASS_h__
#define JASS_h__

#include <vector>

#ifdef _DEFINE_VARS
// declared in JASS.cpp
#define JASSFN(name, type, params)  typedef type name##_t params; name##_t* j##name = (name##_t*)GetJASSPtr(#name)
#else
#define JASSFN(name, type, params)  typedef type name##_t params; extern name##_t* j##name
#endif

struct CStringRep{ // the actual class name is CStringRep ;)
  DWORD vtable;    //0x00
  DWORD refCount;  // 0x04 ?
  DWORD dwUnk1;    // 0x08 ?
  DWORD pUnk2;     // 0x0C ?
  DWORD pUnk3;     // 0x10 ?
  DWORD pUnk4;     // 0x14 this-0xC .o0
  DWORD pUnk5;     // 0x18
  char* data;      // 0x1C ...

  /* sample data :
  0000 - pointer to   ->6F954658      ->6F954658
  0004 - Dword                 2               1
  0008 - Dword         790393882      3076342506
  000C - pointer to   ->1942F14C      ->1942230C
  0010 - pointer to   ->078191FC      ->13FE454C
  0014 - pointer to   ->13FF3C60      ->13FF3C80
  0018 - pointer to   ->13FF3C8C      ->13FF3CAC
  001C - pointer to   ->1262B848      ->1262B858
  */
};

struct RCString{
  DWORD vtable;     //0x00
  DWORD dw0;        //0x04  - always 0 ?
  CStringRep* data; //0x08
  DWORD dw1;        //0x0C  - string type ? probably... there is also RCStaticString etc...

  /* sample data :
  0000 - pointer to   ->6F87688C      ->6F87688C
  0004 - Dword    0           0
  0008 - pointer to   ->13FF3C6C      ->13FF3C6C
  000C - Word     15          15
  */
};

struct JASSVar
{
  long hash;                 // 0x0
  struct HT_Bucket* parent;  // 0x4
  struct JASSVar* next;      // 0x8
  char unk[0x8];             // 0xC
  long name;                 // 0x14
  long vartype;              // 0x18
  long vartype2;             // 0x1C
  long value;                // 0x20
  long is_func_arg;          // 0x24
};

struct JASSArray {
  long x0;
  long size;
  long length;
  long *data;
};

typedef struct {
  char unk[0x18];
  // off by 4!
  const char *name;         //0x18
  int address;              //0x1C
  int narg;                 //0x20
  const char *prototype;    //0x24
  int a;                    //0x28
  int b;                    //0x2C
  int c;                    //0x30
  int d;                    //0x34
  int rettype;              //0x38
} native_info;

DWORD GetJassVM(void);
string jStrGet(HANDLE h);
unsigned long getNumStrings(void);
RCString* MapString(const char* s);

void* GetJASSPtr(const char*);
JASSVar* GetJassVar(const char*);

union DWFP
{
  DWORD dw;
  float fl;
};

JASSFN(AbilityId, int __cdecl, (RCString*));
JASSFN(AbilityId2String, HANDLE /*String*/ __cdecl, ());
JASSFN(Acos, DWFP __cdecl, (float*));
JASSFN(AddHeroXP, void __cdecl, (HANDLE /* Unit */, int, bool));
JASSFN(AddIndicator, void __cdecl, (HANDLE /* Widget */, int, int, int, int));
JASSFN(AddItemToAllStock, void __cdecl, (int, int, int));
JASSFN(AddItemToStock, void __cdecl, (HANDLE /* Unit */, int, int, int));
JASSFN(AddLightning, HANDLE /* Lightning */ __cdecl, (RCString*, bool, float*, float*, float*, float*));
JASSFN(AddLightningEx, HANDLE /* Lightning */ __cdecl, (RCString*, bool, float*, float*, float*, float*, float*, float*));
